[
  {
    "id" : 1,
    "title": "Quadcopter UAV brushless drone motor manufacturing",
    "description": "The power source of the quad-rotor drone is mainly four motors. The electrical energy provided by the motor is converted into machinery to rotate the propeller of the drone to achieve flight. The motor is mainly composed of a stator, a rotor, an iron core, magnets, etc. The motors used are mainly brush motors and brushless motors. The main structure of a brushed motor includes a stator, a rotor and a brush. The brushes are in constant contact with the steering gear and play a role in conduction and commutation during rotation. They obtain rotational torque through the rotating magnetic field and output electrical energy. The main components of a brushless motor include a stator, a rotor, a position sensor and an electronic switch circuit. However, in order to reduce the weight of model aircraft and small drones, there is no position sensor in the structure of the drone, but electronics are used instead. governor. In terms of rotor type, the majority of UAV brushless motors have rotors other than rotors. Comparing the two motors, the brushed motor can work continuously for about 5,000 hours and has a service life of between 2-3 years; while the brushless motor can work continuously for more than 20,000 hours, and the service life is 2-3 times that of the brushed motor. It can be used for 7-10 years. At the same time, the brushless motor is more energy-saving, and its power consumption is only 1/3 of the brushed motor. Although the electronic switching circuit of the brushless DC motor is very complex, compared with similar products, based on considerations such as stability, operating noise, mechanical performance, electromagnetic interference, service life, power per unit volume, torque-to-weight ratio, energy consumption, etc. The BLDC motor is the mainstream choice for quadcopter drone motors. The power source of the quad-rotor UAV comes from the motor driving the rotating propeller to rotate. In the process of converting electrical energy and kinetic energy by the brushless motor, the outer rotor needs to be continuously rotated. The outer rotor is a cylinder inside which is usually a permanent rare earth magnet: (samarium cobalt) SmCo or (neodymium iron boron) NdFeBo. The stator is formed from coils wound around a polar iron core of ferromagnetic material. As current circulates through the coils, new magnetic poles are created, which interact with the rotor's permanent magnetic poles, causing the machine to spin.",
    "date": "2024/02/05"
  },
  {
    "id": 2,
    "title": "Drone motor design and manufacturing related",
    "description": "Unmanned aerial vehicle, referred to as 'unmanned aerial vehicle', or 'UAV' in English, is an unmanned aircraft operated by radio remote control equipment and its own program control device, or is operated completely or intermittently autonomously by an on-board computer. Compared with manned aircraft, drones are often more suitable for high-risk and difficult tasks. UAVs can be divided into military and civilian uses according to their application fields. In terms of military use, UAVs are divided into reconnaissance aircraft and target drones. Civilian applications in aerial photography, agriculture, plant protection, micro-selfies, express transportation, disaster relief, observing wild animals, monitoring infectious diseases, surveying and mapping, news reporting, power inspections, disaster relief, film and television shooting, creating romance, etc., greatly Expanding the uses of drones themselves, developed countries are also actively expanding industry applications and developing drone technology. The design method of drone motor mainly involves the following aspects: 1. Motor type selection: There are generally two types of drone motors: brushless DC motors and brushed DC motors. Brushless DC motors are widely used in the field of drones because of their advantages such as high efficiency, low noise, long life, and low maintenance costs. The advantage of brushed DC motors is their low cost, but they are gradually being phased out due to their vulnerability to damage and low efficiency. 2. Winding structure: The structure of the motor winding directly determines the efficiency of the motor. A good winding structure can reduce the resistance when current is conducted and improve motor efficiency. The drone motor will generate a lot of heat when running at high speed. If the heat cannot be dissipated in time, the life and performance of the motor will be affected. Therefore, some heat dissipation measures need to be taken, such as installing heat sinks and adding heat dissipation holes. At the same time, choosing a high-quality motor can also improve the heat dissipation effect. When producing brushless motors for drones, the winding process is very important. If the winding effect is not good, it will directly affect the use of the drone. NIDE drone motor outer rotor winding machine adopts automatic winding machine technology to meet the needs of winding multiple motor products at the same time, with high efficiency and high precision. 3. Motor materials: Choosing high-quality materials can minimize motor energy loss and extend the service life of the motor. When selecting materials, it is necessary to evaluate the material's heat resistance, flame retardancy, and wear resistance to ensure that the motor can operate normally in different climates and situations. 4. Size and weight: In order to reduce the total weight of the drone and increase the power density, it is necessary to design an efficient motor in the smallest possible volume. Therefore, when designing a motor, there is a need to balance motor size and weight with efficiency. In addition, the size and weight of the motor also have a certain impact on the stability and flexibility of the drone during flight. 5. Speed controller: The speed controller of the motor can reduce energy loss and improve the efficiency of the motor. Currently, high-precision adaptive control and proportional-integral-derivative control are two commonly used speed controller design methods. In short, UAV motor design requires multiple aspects to be considered and comprehensively measured to find the optimal solution and achieve efficient performance and stable operation. Therefore, motor designers need to comprehensively consider factors such as UAV usage requirements, environmental conditions, materials and process control, and continuously improve and innovate. Ningbo Nide Mechanical Equipment Co., Ltd. focuses on providing customers with one-stop motor manufacturing solutions. We have provided UAV motor stator and rotor assembly lines, UAV motor stator manufacturing lines, UAV motor outer rotor production lines, and UAV motor stator assembly lines for customers in different countries. Motor accessories, such as NdFeB magnets, bearings, shafts, motor casings, etc. We can customize and develop UAV motor manufacturing equipment according to market and customer needs, and assist customers in developing UAV motor products that are small in size, light in weight, and powerful, covering aerial photography UAVs, FPV traversing UAVs, Agricultural drones, plant protection drones, single-rotor drones, multi-rotor drones, fixed-wing drones, etc.",
    "date": "2024/01/30"
  },
  {
    "id" : 3,
    "title": "FPV motor manufacturing solution",
    "description": "With the rapid development and popularization of the drone industry, a new sport was born - it is the FPV flying machine. The racing FPV ride-through motor is a motor specially designed for racing drones. It has the characteristics of high speed, large thrust, lightweight and compact design. The FPV ride-through machine consists of the following basic systems: the frame and the motor form the power system; the battery and ESC form the power supply system; the flight controller and the receiver form the control system; the image transmission, antenna, and camera form the image transmission system (below Referred to as image transmission system). In addition, there are many expansion parts, such as GPS module, card recording camera, etc. The brushless motors used on model aircraft are generally three-phase external rotor brushless motors. Three-phase: The motor has three leads, and the ESC inputs alternating current through the three wires (the brushless motor steering can be changed by exchanging any two of the three wires) to control the motor speed. Outer rotor: The rotating part is exposed (a shell containing permanent magnets and fixed magnets), and the stator (wire coil) is inside. The rotor and stator are connected using bearings. Brushless motor options: The motor provides the pulling force required for FPV traversal drone flight. Generally speaking, the motor of an FPV traversing machine has greater pulling force and consumes more power than the motor of a drone of the same size. Therefore, the motor is one of the main reasons why the traversing machine is fast and has a short endurance. If the pulling force is too small, it will not fly/short endurance, and if the pulling force is too large, it will be difficult to control. Therefore, it is recommended to use a motor that matches the frame size. Of course, if you can control the throttle well (compared to the power consumption of a large motor and a small motor, the torque is greater at the same speed and the power consumption is less at the same pulling force), it can leave a lot of electricity for you. Moreover, all kinds of motors basically have power efficiency meters, and you can see various parameters of the motor: manufacturing specifications, mounting hole positions, propellers, current, pulling force, etc. The maximum static pulling force is greater than or equal to 1.3 times the total weight of the aircraft, mainly because the dynamic pulling force during flight will always be less than the static pulling force, but the maximum static pulling force is preferably less than 2 times the total weight of the aircraft, because the weight of the high-pull brushless motor itself is not small. Selection of motor KV value. The higher the KV value, the higher the motor speed at the same voltage. Therefore, high KV must be matched with a small diameter propeller, or use a lower voltage to prevent overheating and burning. Generally speaking, the lower the KV value, the higher the operating voltage and the higher the motor efficiency, but 6S is generally the highest voltage for medium-sized FPV fixed wings. Finally, the appropriate motor and propeller size must be selected according to the aircraft model. For example, some twin-engine models only support a maximum of 8-inch propellers. Ningbo Nide Machanical Equipment Co., Ltd. has rich motor manufacturing experience and provides customers with various types of motor manufacturing solutions, including drone motor manufacturing lines, FPV traversing machine motor manufacturing and assembly equipment, outer rotor manufacturing lines, and hub motors. Manufacturing production lines, etc.Our FPV ride-through motor manufacturing and assembly line includes a rotor manufacturing line, a stator manufacturing line, and an FPV motor assembly line. If you want to know more about drone motor manufacturing solutions, please feel free to contact us.",
    "date": "2024/01/26" 
  },
  {
    "id": 4,
    "title": "",
    "description": "Flat wire motor X-pin winding technology is a relatively advanced technology. Its main function is to improve the efficiency and power density of the motor, while also reducing the noise and vibration of the motor. In terms of applications, X-pin winding technology is mainly used in electric vehicles, medical equipment, aerospace, etc. These application scenarios have higher performance requirements for motors and require the use of more efficient and reliable motors to meet their performance requirements.X-pin winding is a type of flat wire motor. Currently, the common flat wire motors on the market include I-pin and H-pin. The common point is that a small straight section needs to be left in the welding section, which will increase the height of the stator winding end. X-pin removes the straight line segment and reduces the height of the end to make the motor stator more compact. Compared with H-pin and I-pin, the end height of X-pin is lower, which shows that the size of the motor can be further reduced and the power density can be further improved. X-Pin winding is named after the two copper wires overlapped at the solder joint to form an X-shape. X-pin was developed on the basis of I-pin and Hair-pin processes. The winding forming process, The head shape of the solder joints and the welding process of the solder joints are different, but the ultimate goal is to shorten the height of the winding end. At present, scholars and engineers at home and abroad are constantly researching and improving X-pin winding technology to further improve its performance and application scope. For example, new materials and manufacturing processes are used to optimize the structure of the X-pin winding, improve its heat dissipation performance and improve its mechanical strength, etc. These studies and practices have laid a solid foundation for the further development and application of X-pin winding technology.",
    "date": "2024/01/18"
  },
  {
    "id" : 5,
    "title": "Six core manufacturing processes of flat wire motor stator",
    "description": " As one of the hottest technology trends at the moment, flat wire motors are the first to be affected. Since new energy vehicles began to adopt this technology, topics surrounding flat wire motors have become more and more intense. In actual production, flat wire motors will require higher stability and qualification rates than current round wire production. Below are the six core processes in the production process of flat wire motor stators. The current basic process flow of the stator production line: slotting paper → making hairpins → threading hairpins → end ring shaping → end ring welding → star point connection → insulation treatment at the welding area, including center line forming and paper forming and paper insertion. These two processes Synchronization. 01-Paper insertion process There is insulating paper between the stator slot and the conductor of the flat wire motor to ensure the insulation between out-of-phase conductors and between the conductor and the stator core. Generally speaking, the paper insertion process of flat wire motors mainly includes paper forming, paper cutting and paper insertion. Common groove paper forming processes include cold forming and hot forming. The paper shapes mainly include O-type, C-type, B-type, and S-type. The most common ones are O-type. B-type and S-type can significantly improve the insulation performance, but the manufacturing process is more complicated, and the pure copper tank full rate is low. Poor stability. For some motors, due to process reasons, two adjacent out-of-phase conductors in the stator slot must be isolated by two pieces of insulating paper, which causes the insulating paper to occupy a large space and reduces the power density of the motor. In addition, since the two insulating papers are not related to each other, it is currently inconvenient to use equipment to automatically insert them into the stator slot. This has also become a major pain point in the automated manufacturing and production process of flat wire motors. 02-PIN coil forming The stator core part flat wire motor manufacturing mainly includes several process categories such as I-PIN, Hairpin, Wave Winding and so on. The PIN coil needs to go through a series of processes such as straightening, patent leather removal, cutting, and molding. Laser patent leather removal and traditional patent leather removal are generally used. Among them, although the traditional method is low in cost, it also has problems such as incomplete paint removal and damage to copper wires. The main forming processes include stamping forming and spring machine technology forming. The latter is more expensive but causes less damage to the copper wire. 03-Coil insertion Insert the card coil into the profiling tooling, then firmly insert all the card issuing coils into the iron core, and press them into the corresponding design size. In this part of the process, cross-layer automatic insertion has been upgraded from the previous 2-layer and 4-layer processes to the latest 6-layer and 8-layer processes. There are also some domestic companies that can complete the manufacturing of this product. 04-Enlarging & twisting & welding Expansion process: Move the fixture positioning mechanism equipped with the stator to the expansion station to be layered. The expansion mechanism covers the upper ends of the flat wires of all layers except the innermost two layers, and pulls the flat wires to move outward, completing one after another. Flaring of all layers of flat wire. Twisting process: Move the twisting mechanism and stator to the working position, and the expansion mechanism stretches out to resist the ends of the innermost two layers of flat wires, so that the ends of the innermost two layers of flat wires are aligned with the twisting mechanism, and then the expansion mechanism starts from the flat wire. The upper end of the wire is removed and shrunk back, and then the ends of the innermost two layers of flat wires are inserted into the twisting mechanism. The inner mold and the outer mold of the twisting mechanism rotate in opposite directions to complete the twisting process of the innermost two layers of flat wires and complete everything again. Flat wire twist. Welding process: The existing welding methods mainly include laser welding or argon arc welding. Both methods melt copper through instantaneous high temperature to form solder joints, thereby realizing the electrical connection of windings. At the same time, there are also other companies using CMT cold welding or other welding methods. There are two main shortcomings in existing laser welding or argon arc welding technology: First, laser welding and argon arc welding require an instantaneous high temperature to melt the copper, which can easily damage the enameled wire film around the welding point and reduce the insulation reliability; Second, there are a large number of hairpin coils or single-sided coils that constitute the stator winding of the flat wire motor, which requires a large number of solder joints. Laser welding or argon arc welding generally welds the solder joints one by one, which seriously affects the production efficiency of the flat wire stator. 05-Coating & Dipping The detailed flow of this process is as follows: coating and loading → armature preheating → armature coating → armature curing → coating and unloading → weighing the armature before dripping paint → scanning the code before armature dripping paint → armature Paint dripping and loading → armature preheating → armature paint dripping → armature gel curing → armature unloading → armature dripping paint and weighing, etc. → There are currently two main types of coating materials: powder and liquid; the dipping process mainly includes traditional dipping, vacuum dipping, vacuum pressure dipping, drip dipping, etc., as well as EUV dipping process.06-Stator potting For a long time, motor thermal management has been a major challenge faced by many car companies. The increasing cruising range and power density have put forward higher heat dissipation requirements for motors. Currently, motors have always relied on cooling systems to achieve thermal management. At present, motor manufacturing mainly uses the impregnation process, but there are problems such as poor heat dissipation performance, easy breakage, and intolerance to organic oil. In this case, the vacuum potting process came into being. For vacuum potting, the required potting resin needs to have the following characteristics: It should have good fluidity before curing. It can penetrate into the uneven gaps on the winding surface. After potting, the outer surface of the workpiece should be smooth and flat, so that the rotating part of the motor has basically the same moment of inertia when rotating, reducing the sudden mechanical stress caused by sudden changes in the speed and steering of the motor. Vibration caused by thermal changes reduces the resistance of the cooling medium to the rotating part of the motor. It should have strong adhesion to the motor windings, strong resistance to hot and cold shock toughness, and sufficiently high mechanical strength. It should have a high thermal conductivity to reduce the temperature difference between the inner and outer surfaces of the potting compound. On the one hand, it can quickly conduct the heat generated during the operation of the motor winding to the outer surface of the workpiece. On the other hand, it can reduce the internal stress caused by temperature difference. It has good electrical insulation properties and oil resistance. After potting, the motor stator forms a whole, the heat dissipation and stator modal stiffness and damping performance are improved, the temperature rise and vibration noise are reduced, and the moisture resistance, shock resistance, and corona resistance are improved. promoted. Ningbo Nide Mechanical Equipment Co., Ltd. focuses on motor manufacturing solutions, providing hairpin motor manufacturing equipment to customers in many countries around the world, and providing customers with large-scale hairpin motor production lines. By using open coil segments prefabricated with rectangular cross-section wires and a high degree of automation, motor hairpin technology produces high-quality stators with higher filling rates.",
    "date" : "2024/01/12"
  }
  
]
